// Приклад того як ми писали до тернарного оператора
// const year = prompt("В якому році вишйшов фільм Star Wars");
// if(year == 1977){
//     alert('Все вірно')
// }else{
//     alert('Невірно')
// }


// Теж саме тільки ми запишемо через тернарний оператор
// const year = 1977;
// const result = year === 1977 ? "Все вірно" : "невірно"
// console.log(result)


//Запитайте у користувача гостроту зору. Якщо вона краще, Ніж -6,
//присвойте йому статус "годен до військової служби". Якщо менше – "Не годен до військової служби".
// Якщо ми робимо через if...else

// let status = "";
// if(userDiopter > -6) {
//  status = "годен до військової служби"
// }
// else {
//  status = "Не годен до військової служби"
// }


// Теж саме тільки ми запишемо через тернарний оператор

// const userDiopter = prompt("Введіть свою гостроту зору");
// const status = (userDiopter > -6) ? "годен до військової служби" : "Не годен до військової служби"
// console.log(status)